<?php declare(strict_types=1);

namespace App\Tests\Unit;

use App\DTO\Board;
use App\DTO\Values\CellValue;
use App\Service\NonogramSolver;
use App\Service\NonogramSolverStrategy\CheckCompletedStrategy;
use App\Service\NonogramSolverStrategy\FillTheGapStrategy;
use App\Service\NonogramSolverStrategy\PartialHintStrategy;
use App\Service\NonogramSolverStrategy\StandaloneHintStrategy;
use App\Service\NonogramSolverStrategy\StrategyCollection;
use App\Service\NonogramSolverStrategy\StrategyOpenerCollection;
use PHPUnit\Framework\Attributes\DataProvider;
use PHPUnit\Framework\TestCase;

/**
 * Example of expected JSON
 * {
 *     'height': 12,
 *     'width': 12,
 *     'hints': {
 *         'column': ['6', '3 2', '1 3', '4', '2', '1 4', '2 2', '4', '2 2', '5'],
 *         'row': ['4 1 3', '2 2 4', '5 2 1', '1 2 3', '3 2', '2', '2', '2', '1', '1']
 *     },
 *     'data': [                // 2 = open, 1 = filled in, 2 = crossed out
 *         '1111222222',
 *         '1121122222',
 *         '1111122222',
 *         '1211222222',
 *         '1112222222',
 *         '1122222222',
 *         '2222211222',
 *         '2222211222',
 *         '2222212222',
 *         '2222212222'
 *     ]
 * }
 */
class BoardTest extends TestCase
{
    private NonogramSolver $solver;

    public function setUp(): void
    {
        $this->solver = new NonogramSolver(
            new StrategyCollection(
                [
                    new PartialHintStrategy(),
                    new FillTheGapStrategy(),
                    new CheckCompletedStrategy(),
                ],
            ),
            new StrategyOpenerCollection([
                new StandaloneHintStrategy(),
            ])
        );
    }

    public function testBoardDrawing(): void
    {
        $board = new Board(self::dataProvider3x3()[0][0]);
        $board->updateMultipleInRow(1, 1, 3, CellValue::SQUARE_FILLED);
        $board->updateCell(2, 1, CellValue::SQUARE_IGNORED);
        $board->updateCell(2, 2, CellValue::SQUARE_FILLED);
        $board->updateCell(2, 3, CellValue::SQUARE_IGNORED);

        $expected = '
  ┌―――――┬―――――┬―――――┐  
  │  ▇  │  ▇  │  ▇  │  
  ├―――――┼―――――┼―――――┤  
  │  ᚷ  │  ▇  │  ᚷ  │  
  ├―――――┼―――――┼―――――┤  
  │     │     │     │  
  └―――――┴―――――┴―――――┘  
';

        $actual = $board->draw();
        $this->assertSame(trim($expected), trim($actual));
    }

    public function testRowAndColumnUpdateSimultaneously(): void
    {
        $board = new Board($this->dataProvider3x3()[0][0]);

        // solving row 1 should automatically update all 3 columns
        $board->updateMultipleInRow(1, 1, 3, CellValue::SQUARE_FILLED);
        $this->assertSame(['1' => 1, '2' => 1, '3' => 1], $board->getRow(1)->getData());
        $this->assertSame(['1' => 1, '2' => 0, '3' => 0], $board->getColumn(1)->getData());

        $board->updateMultipleInColumn(2, 1, 3, CellValue::SQUARE_FILLED);
        $this->assertSame(['1' => 0, '2' => 1, '3' => 0], $board->getRow(2)->getData());
        $this->assertSame(['1' => 1, '2' => 1, '3' => 1], $board->getColumn(2)->getData());

        // check the whole grid as well to be sure
        $board->updateMultipleInRow(3, 1, 3, CellValue::SQUARE_FILLED);
        $this->assertSame([
            '1' => ['1' => 1, '2' => 1, '3' => 1],
            '2' => ['1' => 0, '2' => 1, '3' => 0],
            '3' => ['1' => 1, '2' => 1, '3' => 1],
        ], $board->getGrid());
    }

    #[DataProvider('dataProvider3x3')]
    public function testSolver3x3(string $input, array $expected): void
    {
        $solvedBoard = $this->solver->solve(new Board($input));
        $actual = $solvedBoard->getGrid();

        $this->assertSame($expected, $actual);
    }

    #[DataProvider('dataProvider5x5')]
    public function testSolver5x5(string $input, array $expected): void
    {
        $solvedBoard = $this->solver->solve(new Board($input));
        $actual = $solvedBoard->getGrid();

        $this->assertSame($expected, $actual);
    }

    #[DataProvider('dataProvider10x10')]
    public function testSolver10x10(string $input, array $expected): void
    {
        $solvedBoard = $this->solver->solve(new Board($input));
        $actual = $solvedBoard->getGrid();

        $this->assertSame($expected, $actual);
    }

    /**
     *  ┌―――――┬―――――┬―――――┐
     *  │  ▇  │  ▇  │  ▇  │
     *  ├―――――┼―――――┼―――――┤
     *  │  ᚷ  │  ▇  │  ᚷ  │
     *  ├―――――┼―――――┼―――――┤
     *  │  ▇  │  ▇  │  ▇  │
     *  └―――――┴―――――┴―――――┘
     */
    public static function dataProvider3x3(): array
    {
        $testData = [
            'height' => 3,
            'width' => 3,
            'hints' => [
                'row' => ['1' => '3', '2' => '1', '3' => '3'],
                'column' => ['1' => '1 1', '2' => '3', '3' => '1 1'],
            ],
            'data' => [],
        ];

        $solution = [
            '1' => ['1' => 1, '2' => 1, '3' => 1],
            '2' => ['1' => 2, '2' => 1, '3' => 2],
            '3' => ['1' => 1, '2' => 1, '3' => 1],
        ];

        return [
            [
                json_encode($testData, JSON_THROW_ON_ERROR),
                $solution,
            ]
        ];
    }

    /**
     *  ┌―――――┬―――――┬―――――┬―――――┬―――――┐
     *  │  ▇  │  ᚷ  │  ▇  │  ᚷ  │  ▇  │
     *  ├―――――┼―――――┼―――――┼―――――┼―――――┤
     *  │  ᚷ  │  ▇  │  ▇  │  ▇  │  ᚷ  │
     *  ├―――――┼―――――┼―――――┼―――――┼―――――┤
     *  │  ▇  │  ▇  │  ▇  │  ▇  │  ▇  │
     *  ├―――――┼―――――┼―――――┼―――――┼―――――┤
     *  │  ᚷ  │  ▇  │  ▇  │  ▇  │  ᚷ  │
     *  ├―――――┼―――――┼―――――┼―――――┼―――――┤
     *  │  ▇  │  ᚷ  │  ▇  │  ᚷ  │  ▇  │
     *  └―――――┴―――――┴―――――┴―――――┴―――――┘
     */
    public static function dataProvider5x5(): array
    {
        $testData = [
            'height' => 5,
            'width' => 5,
            'hints' => [
                'row' => ['1' => '1 1 1', '2' => '3', '3' => '5', '4' => '3', '5' => '1 1 1'],
                'column' => ['1' => '1 1 1', '2' => '3', '3' => '5', '4' => '3', '5' => '1 1 1'],
            ],
            'data' => [],
        ];

        $solution = [
            '1' => ['1' => 1, '2' => 2, '3' => 1, '4' => 2, '5' => 1],
            '2' => ['1' => 2, '2' => 1, '3' => 1, '4' => 1, '5' => 2],
            '3' => ['1' => 1, '2' => 1, '3' => 1, '4' => 1, '5' => 1],
            '4' => ['1' => 2, '2' => 1, '3' => 1, '4' => 1, '5' => 2],
            '5' => ['1' => 1, '2' => 2, '3' => 1, '4' => 2, '5' => 1],
        ];

        return [
            [
                json_encode($testData, JSON_THROW_ON_ERROR),
                $solution,
            ]
        ];
    }

    /**
     *                                                          1
     *                            2                 2     3     1
     *                      1     1     3     1     1     2     2
     *          2     3     2     2     1     2     1     2     1    10
     *       ┌―――――┬―――――┬―――――┬―――――┬―――――┬―――――┬―――――┬―――――┬―――――┬―――――┐
     *   2 2 │  ᚷ  │  ᚷ  │  ᚷ  │  ▇  │  ▇  │  ᚷ  │  ᚷ  │  ᚷ  │  ▇  │  ▇  │
     *       ├―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┤
     *   5 1 │  ᚷ  │  ᚷ  │  ᚷ  │  ▇  │  ▇  │  ▇  │  ▇  │  ▇  │  ᚷ  │  ▇  │
     *       ├―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┤
     *   1 4 │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ▇  │  ᚷ  │  ▇  │  ▇  │  ▇  │  ▇  │
     *       ├―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┤
     * 4 1 1 │  ▇  │  ▇  │  ▇  │  ▇  │  ᚷ  │  ᚷ  │  ᚷ  │  ▇  │  ᚷ  │  ▇  │
     *       ├―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┤
     *   2 1 │  ▇  │  ▇  │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ▇  │
     *       ├―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┤
     *   3 3 │  ᚷ  │  ▇  │  ▇  │  ▇  │  ᚷ  │  ᚷ  │  ᚷ  │  ▇  │  ▇  │  ▇  │
     *       ├―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┤
     *     8 │  ᚷ  │  ᚷ  │  ▇  │  ▇  │  ▇  │  ▇  │  ▇  │  ▇  │  ▇  │  ▇  │
     *       ├―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┤
     *   1 1 │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ▇  │  ᚷ  │  ᚷ  │  ᚷ  │  ▇  │
     *       ├―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┤
     *   2 1 │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ▇  │  ▇  │  ᚷ  │  ▇  │
     *       ├―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┼―――――┤
     *     3 │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ᚷ  │  ▇  │  ▇  │  ▇  │
     *       └―――――┴―――――┴―――――┴―――――┴―――――┴―――――┴―――――┴―――――┴―――――┴―――――┘
     */
    public static function dataProvider10x10(): array {
        $testData = [
            'height' => 10,
            'width' => 10,
            'hints' => [
                'row' => [
                    '1' => '2 2',
                    '2' => '5 1',
                    '3' => '1 4',
                    '4' => '4 1 1',
                    '5' => '2 1',
                    '6' => '3 3',
                    '7' => '8',
                    '8' => '1 1',
                    '9' => '2 1',
                    '10' => '3',
                ],
                'column' => [
                    '1' => '2',
                    '2' => '3',
                    '3' => '1 2',
                    '4' => '2 1 2',
                    '5' => '3 1',
                    '6' => '1 2',
                    '7' => '2 1 1',
                    '8' => '3 2 2',
                    '9' => '1 1 2 1',
                    '10' => '10'
                ],
            ],
            'data' => [],
        ];

        $solution = [
            '1'  => ['1' => 2, '2' => 2, '3' => 2, '4' => 1, '5' => 1, '6' => 2, '7' => 2, '8' => 2, '9' => 1, '10' => 1],
            '2'  => ['1' => 2, '2' => 2, '3' => 2, '4' => 1, '5' => 1, '6' => 1, '7' => 1, '8' => 1, '9' => 2, '10' => 1],
            '3'  => ['1' => 2, '2' => 2, '3' => 2, '4' => 2, '5' => 1, '6' => 2, '7' => 1, '8' => 1, '9' => 1, '10' => 1],
            '4'  => ['1' => 1, '2' => 1, '3' => 1, '4' => 1, '5' => 2, '6' => 2, '7' => 2, '8' => 1, '9' => 2, '10' => 1],
            '5'  => ['1' => 1, '2' => 1, '3' => 2, '4' => 2, '5' => 2, '6' => 2, '7' => 2, '8' => 2, '9' => 2, '10' => 1],
            '6'  => ['1' => 2, '2' => 1, '3' => 1, '4' => 1, '5' => 2, '6' => 2, '7' => 2, '8' => 1, '9' => 1, '10' => 1],
            '7'  => ['1' => 2, '2' => 2, '3' => 1, '4' => 1, '5' => 1, '6' => 1, '7' => 1, '8' => 1, '9' => 1, '10' => 1],
            '8'  => ['1' => 2, '2' => 2, '3' => 2, '4' => 2, '5' => 2, '6' => 1, '7' => 2, '8' => 2, '9' => 2, '10' => 1],
            '9'  => ['1' => 2, '2' => 2, '3' => 2, '4' => 2, '5' => 2, '6' => 2, '7' => 1, '8' => 1, '9' => 2, '10' => 1],
            '10' => ['1' => 2, '2' => 2, '3' => 2, '4' => 2, '5' => 2, '6' => 2, '7' => 2, '8' => 1, '9' => 1, '10' => 1],
        ];

        return [
            [
                json_encode($testData, JSON_THROW_ON_ERROR),
                $solution,
            ]
        ];
    }
}
